import { RiskGroupData } from './riskGroups';

// Подаци за Групу 5 - Критеријум за идентификацију ризика од пожара
export const GROUP5_DATA: RiskGroupData = {
    id: "group5",
    name: "Прилог Е (нормативан)",
    description: "Критеријум за идентификацију ризика од пожара",
    risks: [
        {
            id: "5.1",
            title: "Постојање нормативних аката у складу са правном регулативом (правилник о заштити од пожара, одлуке, правила заштите од пожара, план заштите од пожара или водичица)",
            items: [
                {
                    id: "5.1.1",
                    levels: {
                        5: "1. Организација поседује план заштите од пожара израђен од неструктурне фирме и неповерен од надлежног органа. Остала документа не поседује.",
                        4: "1. Организација поседује нормативна акта која није одобрено надлежни орган у складу са законом о заштити од пожара и потпуно их примењује у пословању.",
                        3: "1. Организација поседује нормативна акта која је оверио надлежни орган, али их ради не примењује.",
                        2: "1. Организација у раду предузима интерне превентивне мере и мере заштите од пожара.",
                        1: "1. Организација поседује сва нормативна акта у складу са законом о заштити од пожара и потпуно их примењује у пословању."
                    }
                },
                {
                    id: "5.1.2",
                    levels: {
                        5: "2. Превентивне мере и мере заштите од пожара се повремено и појединачно примењују.",
                        4: "2. Организација у раду предузима интерне превентивне мере и мере заштите од пожара.",
                        3: "2. Организација у раду предузима интерне превентивне мере и мере заштите од пожара.",
                        2: "2. Организација у раду предузима интерне превентивне мере и мере заштите од пожара.",
                        1: "2. Организација у раду предузима интерне превентивне мере и мере заштите од пожара."
                    }
                },
                {
                    id: "5.1.3",
                    levels: {
                        5: "3. Заштита од пожара није уграђена у пословне организације.",
                        4: "3. Заштита од пожара је уграђена у пословне организације.",
                        3: "3. Заштита од пожара је уграђена у пословне организације.",
                        2: "3. Заштита од пожара је уграђена у пословне организације.",
                        1: "3. Заштита од пожара је уграђена у пословне организације."
                    }
                }
            ]
        },
        {
            id: "5.2",
            title: "Постојање категоризације правних лица и организовање у складу са степеном угрожености према прописима",
            items: [
                {
                    id: "5.2.1",
                    levels: {
                        5: "1. Организација нема обавезу о извршеној категоризацији.",
                        4: "1. Организација нема обавезу о извршеној категоризацији.",
                        3: "1. Организација има обавезу о извршеној категоризацији.",
                        2: "1. Организација има обавезу о извршеној категоризацији.",
                        1: "1. Организација има обавезу о извршеној категоризацији."
                    }
                },
                {
                    id: "5.2.2",
                    levels: {
                        5: "2. Није извршена је интерна процена угроженост и организација није извршена у складу са проценом угрожености.",
                        4: "2. Извршена је интерна процена угроженост и организација није извршена у складу са проценом угрожености, али неј само о важним сегментима пословања.",
                        3: "2. Организација није извршена у складу са проценом угрожености у највећем броју случајева. Има мањи број пропуста.",
                        2: "2. Организација је извршена у складу са проценом угрожености у највећем броју случајева. Има мањи број пропуста.",
                        1: "2. Организација је извршена у складу са проценом угрожености у потпуности у складу са проценом угрожености."
                    }
                }
            ]
        },
        {
            id: "5.3",
            title: "Постојање кадровске и техничке попуњености и квалификованости људства које ради на пословима заштите од пожара у складу са прописима",
            items: [
                {
                    id: "5.3.1",
                    levels: {
                        5: "Организација није кадровски и технички попуњена у складу са проценом угрожености са мање од 50% људства од квалификованог људства за обављање послова из области заштите од пожара. Није ангажовано екстерно овлашћено правно лице.",
                        4: "Организација је кадровски и технички попуњена у складу са проценом угрожености са мање од 50% људства од квалификованог људства за обављање послова из области заштите од пожара. Повремено се ангажује екстерно овлашћено лице, велики пропусти у раду на пословима заштите од пожара.",
                        3: "Организација је кадровски и технички попуњена у складу са проценом угрожености са око 50% људства од квалификованог људства за обављање послова из области заштите од пожара. Повремено се ангажује екстерно овлашћено лице.",
                        2: "Организација је кадровски и технички попуњена у складу са проценом угрожености са око 90% људства од квалификованог људства за обављање послова из области заштите од пожара. На основу систематизације су дефинисана радна места за обављање послова из области заштите од пожара. Ангажовано је екстерно овлашћено правно лице, са мањим пропустима у раду на пословима заштите од пожара.",
                        1: "Организација је кадровски и технички попуњена у складу са проценом угрожености. На основу систематизације су дефинисана радна места за обављање послова из области заштите од пожара. Ангажовано је екстерно овлашћено правно лице."
                    }
                }
            ]
        },
        {
            id: "5.4",
            title: "Постојање и одржавање уређаја, опреме, инсталација и средстава за заштиту од пожара према Закону о заштити од пожара, техничким прописима и унутрашњим прописима опреме",
            items: [
                {
                    id: "5.4.1",
                    levels: {
                        5: "Организација не поседује уređаје, опрему, инсталације и средства за заштиту од пожара у складу са законом или су потпуно неисправни и неупотребљиви.",
                        4: "Организација не поседује све прописане уређаје, опрему, инсталације и средства за заштиту од пожара у складу са законом. Није комплетан, неисправан и неупотребљив. Повремено прегледе и одржавање врше неструктна лица.",
                        3: "Организација поседује све прописане уређаје, опрему, инсталације и средства за заштиту од пожара у складу са законом до 50% није комплетан, неисправан и неупотребљив. Прегледе и одржавање врше неструктна лица.",
                        2: "Организација поседује све прописане уређаје, опрему, инсталације и средства за заштиту од пожара у складу са законом. Мањи део није комплетан, неисправан и неупотребљив. Врше се редовни прегледи и одржавање.",
                        1: "Организација поседује све прописане уређаје, опрему, инсталације и средства за заштиту од пожара у складу са законом. Све је комплетан, исправан и употребљив. Врше се редовни прегледи и одржавање."
                    }
                }
            ]
        },
        {
            id: "5.5",
            title: "Постојање програма основне обуке и савршенија обуке запослених из области заштите од пожара",
            items: [
                {
                    id: "5.5.1",
                    levels: {
                        5: "Организација не поседује програм основне обуке запослених из области заштите од пожара. Обука се не изводи. Не постоје свидетнице о обученост запослених за заштиту од пожара.",
                        4: "Организација поседује интерни програм основне обуке запослених из области заштите од пожара који није оверио надлежни орган. Обука се изводи нередовно, неструктно лица. Постоје неажурне свидетнице о обученост запослених за заштиту од пожара.",
                        3: "Организација поседује интерни програм основне обуке запослених из области заштите од пожара који није оверио надлежни орган. Обука се изводи редовно, у складу са програмом. Постоје ажурне свидетнице о обученост запослених за заштиту од пожара.",
                        2: "Организација поседује верификован програм основне обуке запослених из области заштите од пожара. Обука се изводи редовно, у складу са програмом. Постоје ажурне свидетнице о обученост запослених за заштиту од пожара.",
                        1: "Организација поседује верификован програм основне обуке запослених из области заштите од пожара. Обука се изводи редовно, у складу са програмом. Постоје ажурне свидетнице о обученост запослених за заштиту од пожара."
                    }
                }
            ]
        },
        {
            id: "5.6",
            title: "Постојање свидетница о надзору противпожарне инспекције и постојање наложених мера заштите од пожара",
            items: [
                {
                    id: "5.6.1",
                    levels: {
                        5: "Организација не поседује доказ о извршеном надзору противпожарне инспекције. Не постоји имплементација наложених мера.",
                        4: "Организација поседује доказ о извршеном надзору противпожарне инспекције. Врши се делимична имплементација наложених мера.",
                        3: "Организација поседује доказ о извршеном надзору противпожарне инспекције. Врши се редовна и потпуна имплементација наложених мера.",
                        2: "Организација поседује доказ о извршеном надзору противпожарне инспекције. Врши се делимична имплементација наложених мера.",
                        1: "Организација поседује доказ о извршеном надзору противпожарне инспекције. Врши се потпуна имплементација наложених мера."
                    }
                }
            ]
        }
    ]
};